option = f'Введите свой вариант: '
yes = "да"
no = "нет"
only_yes_and_no: str = "Только да или нет"
diagrams_not_print = "Диаграммы не будут выведены"
analysis_not_print = "Анализ не будет выведен"
work_number = "Какую работу из (5) вывести? "
table_1 = '🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️Таблица 1.1🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️'
table_2 = '🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️Таблица 1.3🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️'
table_3 = '🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️Таблица 1.4🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️'
table_4 = '🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️Таблица 2.1🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️'
table_5 = '🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️Таблица 2.3🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️'
table_6 = '🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️Таблица 2.4🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️🕸️'

specifications = 'Характеристики'
distance = "Расстояние, км"
type_cargo = "Род перевозимого груза"
trans_cargo = {
    'forward': "Прямое направление",
    'reverse': "Обратное направление"}
ports = 'Порты'
type_ports = {
    'departures': "Порт отправления",
    'appointments': "Порт назначения"}
ship_types = "Варианты типов судов (номера проектов)"
overall_length = "Длина габаритная, м"
overall_width = "Ширина габаритная, м"
side_height = "Высота борта, м"
draft_cargo = "Осадка в грузу: в море, м"
engine_power = "Мощность главных двигателей, л.с."
empty_speed = "Скорость в грузу & порожнем, км/ч"
autonomy_swim = "Автономность плавания, сут."
crew = "Экипаж"
deadweight = "Дедвейт, т в море & на реке"
deadweight_types = {
    'sea': "Дедвейт, т в море",
    'river': "Дедвейт, т на реке"
}

load_capacity = "Грузоподъёмность (при 100 % запасов) в море, т"
gross_capacity = "Валовая вместимость GT (МК-1969)"
net_capacity = "Чистая вместимость NT (МК-1969)"
holds = "Число трюмов, ед."
hold_capacity = "Вместимость трюмов, м3"
container_capacity = "Контейнеровместимость, ед."

type_ship = "Тип судна*"
project_number = "Номер проекта"
book_value = "Балансовая стоимость, тыс. долл."
share_capital = 'Акционерный капитал учредителя, Аакi, тыс. долл.'
count_ship = "Кол-во судов данного проекта, nci"

calculation_carrying_capacity = "Расчёт провозной способности судов"
calculation_duration_turn = "Расчёт продолжительности оборота cудов"

ship_1 = 'Судно №1'
ship_2 = 'Судно №2'
ship_3 = 'Судно №3'

specific_cargo_capacity = "Удельная грузовместимость судна, куб. м/т"
load_volume_f = "Удельный погрузочный объем в прямом направлении, м3/т"
load_volume_r = "Удельный погрузочный объем в обратном направлении, м3/т"
loading_ship_f = "Норма загрузки судна: в прямом направлении, т"
loading_ship_r = "Норма загрузки судна: в обратном направлении, т"
capacity_factor_f = "Коэффициент использования грузоподъемности судна: в прямом направлении"
capacity_factor_r = "Коэффициент использования грузоподъемности судна: в обратном направлении"
speed_cargo_f = "Скорость хода с грузом: в прямом направлении, км/ч"
speed_cargo_r = "Скорость хода с грузом: в обратном направлении, км/ч"
time_with_cargo_f = "Время хода с грузом: tх гр, час в прямом направлении"
time_with_cargo_r = "Время хода с грузом: tх гр, час в обратном направлении"
flight_time_f = "Время рейса в прямом направлении, сут."
flight_time_r = "Время рейса в обратном  направлении, сут."
duration_turnover = "Продолжительность оборота, сут. "
load_volume = "Удельный погрузочный объем в прямом/обратном направлении, м3/т"

loading_ship = "Норма загрузки судна в прямом/обратном направлении, т"
capacity_factor = "Коэффициент использования грузоподъемности судна в прямом/обратном направлении"
speed_cargo = "Скорость хода с грузом в прямом/обратном направлении, км/ч"
time_with_cargo = "Время хода с грузом в прямом/обратном направлении, сут"
flight_time = "Время рейса в прямом/обратном направлении, сут."

carrying_capacity = "Расчёт провозной способности судов различных проектов за эксплуатационный период"

specifications_international = "Характеристики судов заграничного плавания"
name_ship = "Название судна"
cost_price = "Себестоимость содержания без топлива – С, долл./сут."
specific_fuel = "Удельный расход топлива – Рт, кг/км"
number_crew = "Экипаж – mэк, чел"

structure_turn = "Структура расходов за оборот"
revenue_turn = "Расчёт доходов за оборот"
determination_cost = "Определение себестоимости перевозок грузов в прямом и обратном направлении по каждому судну, долл./т"
freight_rate = "Определение расчётной фрахтовой ставки, долл./т"
income_years = "Определение годовых доходов от перевозки грузов судном"
expenses_years = "Определение годовых расходов от перевозки грузов судном"

cost_maintaining_f = "Затраты судно без учета стоимости топлива в прямом направлении"  # Эокр.пр = Со * tкр.пр
cost_maintaining_r = "Затраты на судно без учета стоимости топлива в обратном направлении"  # Эокр.пр = Со * tкр.пр
abbrev_cost_maintaining = "Затраты на судно без стоимости топлива"
crew_expenses_f = "Расходы содержания экипажа в прямом направлении"  # Ээккр.пр = mэк * 18 * tкрпр
crew_expenses_r = "Расходы содержания экипажа в обратном направлении"  # Ээккр.пр = mэк * 18 * tкрпр
abbrev_crew_expenses = "Расходы на экипажа"
ship_fees = "Cудовые сборы"  # ∑Ссс
fuel_costs = "Расходы на топливо в прямом (обратном) направлении"  # Эткр.пр = 700 * Рт * 712 * 0,00108
abbrev_fuel_costs = "Расходы на топливо"
consumption_f = "Расходы за прямое направление"  # Эокрпр + Ээккрпр + Эсскрпр + Эткрпр
consumption_r = "Расходы за обратное направление"
full_consumption = "Расходы за оборот"

grey_color = "grey"
value_money = "долл"
weight = "bold"
location = "center left"

title_work_4 = "Определение минимальных объёмов перевозок грузов при заданной фрахтовой ставке"
minimum_volume_transportation = "Минимальный объём перевозок грузов Gmin"  # Gmin = Эн/(fср – Sср  *  (1 – Y))
operating_costs = "Эксплуатационные расходы по судну Энi"  # Эн = Эi * Y
independent_expenses = "Доля независимых расходов Y"  # Y = Эооб/Эоб
expenses_navigation_period = "Расходы по судну за навигационный период Эперi"  # Эперi = Sср * Gi долл
carrying_capacity_navigation_period = "Провозная способность судна за навигационный период Gi"  # Gi = nобi * (Qэпрi + Qэобрi)
revenue_transportation = "Доходы от перевозок по каждому судну Дперi"  # Дперi = Gi * fсрi.
factor_annual_capacity = "Коэффициент использования годовой провозной способности судна Ки.с."  # Ки.с. = Gmin/Gi.
minimum_income = "Минимальные доходы (порог рентабельности) Дmin"  # Дmin = Gmin * fсрi

charter_equivalent = "Тайм-чартерный эквивалент"  # fтэк = (fср * Qэ – Эссоб – Этоб) / tоб, где Qэ = Qэпр + Qэобр
income_ships = "Доходы от сдачи судов"  # Дар = (365 – Тэ) * fтэк
result = """Вывод: так как выполняется условие,
что тайм-чартерный эквивалент должен быть больше суточного содержания  судна в аренде,
то суда выгодно сдавать в аренду.
"""
expenses_delivery = "Расходы от сдачи"  # Эар = (365 – Тэ) * Со, долл.
gross_profit = "Валовая прибыль"  # Пв = Дпер + Дар – Эпер – Эар
profitability = "Определение рентабельности"  # R = Пв / (Эпер + Эар) * 100%

table_economic_performance = "Экономические показатели работы судов"

text_names = ("length_1", 'length_2', 'length_3',

              'width_1', 'width_2', 'width_3',

              'height_1', 'height_2', 'height_3',

              'draft_cargo_1', 'draft_cargo_2', 'draft_cargo_3',

              'power_1', 'power_2', 'power_3',

              'speed_1', 'speed_2', 'speed_3',

              'autonomy_swim_1', 'autonomy_swim_2', 'autonomy_swim_3',

              'deadweight_1', 'deadweight_2', 'deadweight_3',

              'load_capacity_1', 'load_capacity_2', 'load_capacity_3',

              'gross_capacity_1', 'gross_capacity_2', 'gross_capacity_3',

              'net_capacity_1', 'net_capacity_2', 'net_capacity_3',

              'holds_1', 'holds_2', 'holds_3',

              'hold_capacity_1', 'hold_capacity_2', 'hold_capacity_3',

              'container_capacity_1', 'container_capacity_2', 'container_capacity_3')

text_names_2 = (
    'specific_capacity_1', 'specific_capacity_2', 'specific_capacity_3',

    'load_volume_f_1', 'load_volume_f_2', 'load_volume_f_3',
    'load_volume_r_1', 'load_volume_r_2', 'load_volume_r_3',

    'capacity_factor_f_1', 'capacity_factor_f_2', 'capacity_factor_f_3',
    'capacity_factor_r_1', 'capacity_factor_r_2', 'capacity_factor_r_3',

    'speed_cargo_f_1', 'speed_cargo_f_2', 'speed_cargo_f_3',
    'speed_cargo_r_1', 'speed_cargo_r_2', 'speed_cargo_r_3',

    'time_with_cargo_f_1', 'time_with_cargo_f_2', 'time_with_cargo_f_3',
    'time_with_cargo_r_1', 'time_with_cargo_r_2', 'time_with_cargo_r_3',

    'flight_time_f_1', 'flight_time_f_2', 'flight_time_f_3',
    'flight_time_r_1', 'flight_time_r_2', 'flight_time_r_3',

    'duration_turnover_1', 'duration_turnover_2', 'duration_turnover_3'
)

table_text_6 = (specific_cargo_capacity, loading_ship, capacity_factor,
                speed_cargo, time_with_cargo, flight_time, duration_turnover)

table_text_5 = (charter_equivalent, income_ships, result, expenses_delivery, gross_profit, profitability)

table_text_4 = [name_ship, project_number, cost_price, specific_fuel, number_crew]

table_text_2 = [type_ship, project_number, book_value]
table_text_3 = [project_number, book_value, count_ship, share_capital]

table_text_1 = [overall_length, overall_width, side_height, draft_cargo, engine_power, empty_speed, autonomy_swim,
                deadweight, load_capacity, gross_capacity,
                net_capacity, holds, hold_capacity,
                container_capacity]
